Revit 2026 API

# ImageExportOptionsImageResolution Property

---

The image resolution in dots per inch.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ImageResolution ImageResolution { get; set; }
```
```vb
Public Property ImageResolution As ImageResolution
	Get
	Set
```
```cpp
public:
property ImageResolution ImageResolution {
	ImageResolution get ();
	void set (ImageResolution value);
}
```
```fsharp
member ImageResolution : ImageResolution with get, set
```

#### Property Value

ImageResolution

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

The default is DPI_72.

#### Reference

ImageExportOptions Class

Autodesk.Revit.DB Namespace